app/Controllers/Admin.php

    public function pengguna()
    {
        $ModelUser = new \App\Models\User();
        $user = session()->get('user');
        $user_pengguna = $ModelUser->findAll();

        $data = [
            'user_pengguna' => $user_pengguna,
            'user' => $user['nama_lengkap'],
            'user_status' => $user['status'],

            'user_pagination' => $ModelUser->paginate(10, 'user_pagination'),
---
SELECT *
FROM `user`
SELECT *
FROM `user`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `user`

    public function tambah_pengguna()
    {
        $ModelUser = new \App\Models\User();
        $ModelMapel = new \App\Models\Mapel();

        $mapel['id_mapel'] = $ModelMapel->findAll();
        // $status['status'] = $ModelUser->findAll();
        $user = session()->get('user');
        $user_pengguna = $ModelUser->findAll();
---
SELECT *
FROM `mapel`
SELECT *
FROM `user`

    public function simpan_pengguna()
    {
        $ModelUser = new \App\Models\User();
        $user_pengguna = $ModelUser->findAll();
---
SELECT *
FROM `user`

    public function detail_pengguna($nik)
    {
        $ModelUser = new \App\Models\User();
        $user = session()->get('user');
        $detail = $ModelUser->where(['nik' => $nik])->first();
---
SELECT *
FROM `user`
SELECT *
FROM `user`
WHERE `user`.`nik` = 'kepsek'

    public function mapel()
    {
        $ModelMapel = new \App\Models\Mapel();
        $ModelUser = new \App\Models\User();
        $user = session()->get('user');
        $mapel = $ModelMapel->findAll();
        $user_pengguna = $ModelUser->findAll();
---
SELECT *
FROM `mapel`
SELECT *
FROM `user`