app/Controllers/Admin.php

    public function mapel()
    {
        $ModelMapel = new \App\Models\Mapel();
        $ModelPengguna = new \App\Models\Pengguna();
        $user = session()->get('user');
        $mapel = $ModelMapel->findAll();
        $user_pengguna = $ModelPengguna->findAll();
---
SELECT *
FROM `pengguna`

    public function kelas()
    {
        $ModelKelas = new \App\Models\Kelas();
        $ModelPengguna = new \App\Models\Pengguna();

        $user = session()->get('user');
        $pengguna = $ModelPengguna->findAll();
---
SELECT *
FROM `pengguna`