app/Controllers/Guru.php

    public function index()
    {
        $ModelPengguna = new \App\Models\Pengguna();
        $ModelKelas = new \App\Models\Kelas();
        $ModelMapel = new \App\Models\Mapel();
        $ModelSiswa = new \App\Models\Siswa();

        $user = session()->get('user');
        $user_pengguna = $ModelPengguna->findAll();

        $data = [
            'user_pengguna' => $user_pengguna,
            'user' => $user['nama_lengkap'],
            'user_jabatan' => $user['jabatan'],

            'jumlah_pengguna' => $ModelPengguna->countAll(),
            'jumlah_kelas' => $ModelKelas->countAll(),
            'jumlah_mapel' => $ModelMapel->countAll(),
            'jumlah_siswa' => $ModelSiswa->countAll(),
        ];
---
SELECT *
FROM `pengguna`
SELECT COUNT(*) AS `numrows` FROM `pengguna`
SELECT COUNT(*) AS `numrows` FROM `mapel`
SELECT COUNT(*) AS `numrows` FROM `siswa`
SELECT COUNT(*) AS `numrows` FROM `kelas`

    public function simpan_dh()
    {
        $ModelDH = new \App\Models\DaftarHadir();

        $tanggal = $this->request->getVar('hari_tanggal');
        $kehadiranSiswa = $this->request->getVar('siswa');
        $kelas = $this->request->getVar('kelas');

        if (empty($tanggal) || empty($kehadiranSiswa)) {
            return redirect()->back()->with('error', 'Harap lengkapi data yang dibutuhkan.');
        }

        $tanggal = date('Y-m-d', strtotime($tanggal));

        // validasi
        $cekData = $ModelDH->where('hari_tanggal', $tanggal)
            ->where('nama_kelas', $kelas)
            ->first();
---
SELECT *
FROM `daftar_hadir`
WHERE `hari_tanggal` = '2025-01-31'
AND `nama_kelas` = '68'
 LIMIT 1

    public function hapus_jurnal($jurnal_id)
    {
        $ModelJurnal = new \App\Models\JurnalKelas();

        try {
            $ModelJurnal->delete($jurnal_id);
---
DELETE FROM `jurnal_kelas`
WHERE `jurnal_id` IN ('<')

    public function cetak_jurnal_kelas()
    {
        $ModelKelas = new \App\Models\Kelas();
        $ModelBulan = new \App\Models\Bulan();
        $ModelJurnal = new \App\Models\JurnalKelas();

        $user = session()->get('user');

        $pilih_kelas = $this->request->getPost('pilih_kelas');
        $pilih_bulan = $this->request->getPost('pilih_bulan');
        $pilih_tahun = $this->request->getPost('pilih_tahun');

        $nama_kelas = $ModelKelas->getNamaKelas($pilih_kelas);
        $nama_bulan = $ModelBulan->getNamaBulan($pilih_bulan);

        $kelas = array_column($nama_kelas, 'nama_kelas');
        $kelas_string = implode(",", $kelas);
        $bulan = array_column($nama_bulan, 'nama_bulan');
        $bulan_string = implode(",", $bulan);

        session()->set('pilih_bulan', $pilih_bulan);
        session()->set('pilih_kelas', $pilih_kelas);
        session()->set('pilih_tahun', $pilih_tahun);

        $nama_lengkap = $user['nama_lengkap'];
        $kelas = $ModelKelas->getKelasByWaliKelas($nama_lengkap);
        $bulan = $ModelBulan->findAll();
---
SELECT *
FROM `bulan`

    public function downloadJurnalKelas()
    {
        $ModelSekolah = new \App\Models\Sekolah();

        $kepala_sekolah = $ModelSekolah->findAll();

        $user = session()->get('user');
        $kelas = session()->get('pilih_kelas');
        $bulan = session()->get('pilih_bulan');
---
SELECT *
FROM `sekolah`
SELECT *
FROM `bulan`