app/Controllers/Guru.php

SELECT *
FROM `jurnal_kelas`
WHERE `kelas` = 'VIII A'
SELECT *
FROM `kelas`
---
    public function jurnal_kelas()
    {
        $ModelJurnal = new \App\Models\JurnalKelas();
        $ModelKelas = new \App\Models\Kelas();

        $user = session()->get('user');
        $pilih_kelas = $this->request->getPost('pilih_kelas');
        session()->set('pilih_kelas', $pilih_kelas);
        $jurnal = $ModelJurnal->where('kelas', $pilih_kelas)->findAll();
        $kelas = $ModelKelas->findAll();

SELECT *
FROM `kelas`
SELECT *
FROM `mapel`
---
    public function tambah_jurnal()
    {
        $ModelMapel = new \App\Models\Mapel();
        $ModelKelas = new \App\Models\Kelas();

        $user = session()->get('user');
        $pilih_kelas = session()->get('pilih_kelas');

        $kelas['nama_kelas'] = $ModelKelas->findAll();
        $mapel['id_mapel'] = $ModelMapel->findAll();