app/Controllers/Guru.php

    public function cetak_jurnal_guru()
    {
        $ModelPengguna = new \App\Models\Pengguna();
        $ModelBulan = new \App\Models\Bulan();
        $ModelJurnal = new \App\Models\JurnalKelas();

        $user = session()->get('user');

        $pilih_pengguna = $this->request->getPost('pilih_pengguna');
        $pilih_bulan = $this->request->getPost('pilih_bulan');
        $pilih_tahun = $this->request->getPost('pilih_tahun');

        $nama_pengguna = $ModelPengguna->findAll();
        $nama_bulan = $ModelBulan->getNamaBulan($pilih_bulan);

        $pengguna = array_column($nama_pengguna, 'nama_lengkap');
        $nama_string = implode(",", $pengguna);
        $bulan = array_column($nama_bulan, 'nama_bulan');
        $bulan_string = implode(",", $bulan);

        session()->set('pilih_bulan', $pilih_bulan);
        session()->set('pilih_pengguna', $pilih_pengguna);
        session()->set('pilih_tahun', $pilih_tahun);
        session()->set('bulan_string', $bulan_string);
        session()->set('tahun_string', $pilih_tahun);

        $nama_lengkap = $user['nama_lengkap'];
        $pengguna = $ModelPengguna->getPengguna($nama_lengkap);
        $bulan = $ModelBulan->findAll();
---
SELECT *
FROM `pengguna`
SELECT *
FROM `bulan`