app/Controllers/Kepsek.php

    public function index()
    {
        $ModelPengguna = new \App\Models\Pengguna();
        $ModelKelas = new \App\Models\Kelas();
        $ModelMapel = new \App\Models\Mapel();
        $ModelSiswa = new \App\Models\Siswa();

        $user = session()->get('user');
        $user_pengguna = $ModelPengguna->findAll();

        $data = [
            'user_pengguna' => $user_pengguna,
            'user' => $user['nama_lengkap'],
            'user_jabatan' => $user['jabatan'],

            'jumlah_pengguna' => $ModelPengguna->countAll(),
            'jumlah_kelas' => $ModelKelas->countAll(),
            'jumlah_mapel' => $ModelMapel->countAll(),
            'jumlah_siswa' => $ModelSiswa->countAll(),
---
SELECT *
FROM `pengguna`
SELECT COUNT(*) AS `numrows` FROM `pengguna`
SELECT COUNT(*) AS `numrows` FROM `kelas`
SELECT COUNT(*) AS `numrows` FROM `mapel`
SELECT COUNT(*) AS `numrows` FROM `siswa`

    public function lihat_jurnal_guru()
    {
        $ModelPengguna = new \App\Models\Pengguna();
        $ModelBulan = new \App\Models\Bulan();
        $ModelJurnal = new \App\Models\JurnalKelas();

        $user = session()->get('user');

        $pilih_pengguna = $this->request->getPost('pilih_pengguna');
        $pilih_bulan = $this->request->getPost('pilih_bulan');
        $pilih_tahun = $this->request->getPost('pilih_tahun');

        $nama_pengguna = $ModelPengguna->findAll();
        $nama_bulan = $ModelBulan->getNamaBulan($pilih_bulan);

        $pengguna = array_column($nama_pengguna, 'nama_lengkap');
        $nama_string = implode(",", $pengguna);
        $bulan = array_column($nama_bulan, 'nama_bulan');
        $bulan_string = implode(",", $bulan);

        session()->set('pilih_bulan', $pilih_bulan);
        session()->set('pilih_pengguna', $pilih_pengguna);
        session()->set('pilih_tahun', $pilih_tahun);
        session()->set('bulan_string', $bulan_string);
        session()->set('tahun_string', $pilih_tahun);

        $pengguna = $ModelPengguna->penggunaUrutAbjad();
        $bulan = $ModelBulan->findAll();
---
SELECT *
FROM `pengguna`
SELECT *
FROM `bulan`