app/Controllers/Login.php

    public function index()
    {
        $ModelUser = new \App\Models\Pengguna();
        $ModelJabatan = new \App\Models\Jabatan();

        $listJabatan['jabatan'] = $ModelJabatan->findAll(); // Data jabatan dari database
        $err = null; // Inisialisasi error
        $sign_in = $this->request->getPost('sign_in');

        if ($sign_in) {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');
            $inputJabatan = $this->request->getPost('jabatan');

            // Validasi username
            $user = $ModelUser->where('username', $username)->first();
---
SELECT *
FROM `jabatan`
SELECT *
FROM `pengguna`
WHERE `username` = 'an'
 LIMIT 1