app/Models/Bulan.php

SELECT `nama_bulan`
FROM `bulan`
WHERE `id_bulan` IS NULL
---
    public function getNamaBulan($pilih_bulan)
    {
        return $this->select('nama_bulan')
        ->where('id_bulan', $pilih_bulan)
        ->findAll();