app/Models/DaftarHadir.php

    public function jumlahHadir($tanggal_dh)
    {
        return $this->select("kelas.nama_kelas, daftar_hadir.id_daftar_hadir, daftar_hadir.hari_tanggal,
                SUM(CASE WHEN daftar_hadir.keterangan = 'Hadir' THEN 1 ELSE 0 END) as hadir,
                SUM(CASE WHEN daftar_hadir.keterangan = 'Ijin' THEN 1 ELSE 0 END) as ijin,
                SUM(CASE WHEN daftar_hadir.keterangan = 'Sakit' THEN 1 ELSE 0 END) as sakit,
                SUM(CASE WHEN daftar_hadir.keterangan = 'Alpa' THEN 1 ELSE 0 END) as alpa")
            ->join('kelas','kelas.id_kelas = daftar_hadir.nama_kelas')
            ->where('daftar_hadir.hari_tanggal', $tanggal_dh)
            ->groupBy('kelas.nama_kelas')
            ->orderBy('kelas.nama_kelas', 'ASC')
            ->findAll();
---
SELECT `kelas`.`id_kelas`, `kelas`.`nama_kelas`, `daftar_hadir`.`id_daftar_hadir`, `daftar_hadir`.`hari_tanggal`, SUM(CASE WHEN daftar_hadir.keterangan = 'Hadir' THEN 1 ELSE 0 END) as hadir, SUM(CASE WHEN daftar_hadir.keterangan = 'Ijin' THEN 1 ELSE 0 END) as ijin, SUM(CASE WHEN daftar_hadir.keterangan = 'Sakit' THEN 1 ELSE 0 END) as sakit, SUM(CASE WHEN daftar_hadir.keterangan = 'Alpa' THEN 1 ELSE 0 END) as alpa
FROM `daftar_hadir`
JOIN `kelas` ON `kelas`.`id_kelas` = `daftar_hadir`.`nama_kelas`
WHERE `daftar_hadir`.`hari_tanggal` = '2025-02-22'
GROUP BY `kelas`.`nama_kelas`
ORDER BY `kelas`.`nama_kelas` ASC