app/Models/JurnalKelas.php

    public function getJurnalJoinKelasMapel($pilih_kelas)
    {
        return $this->select('jurnal_kelas.* , kelas.nama_kelas, mapel.nama_mapel')
        ->join('kelas','jurnal_kelas.nama_kelas = kelas.id_kelas')
        ->join('mapel','jurnal_kelas.mapel = mapel.id_mapel')
        ->where('jurnal_kelas.nama_kelas', $pilih_kelas)
        // ->groupBy('kelas.nama_kelas')
        // ->orderBy('kelas.nama_kelas', 'ASC')
        ->findAll();
---
SELECT `jurnal_kelas`.*, `kelas`.`nama_kelas`, `mapel`.`nama_mapel`
FROM `jurnal_kelas`
JOIN `kelas` ON `jurnal_kelas`.`nama_kelas` = `kelas`.`id_kelas`
JOIN `mapel` ON `jurnal_kelas`.`mapel` = `mapel`.`id_mapel`
WHERE `jurnal_kelas`.`nama_kelas` IS NULL