app/Models/Jurnal.php

    public function getJurnalJoinKelasMapel($pilih_kelas)
    {
        return $this->select('jurnal.* , kelas.nama_kelas, mapel.nama_mapel')
            ->join('kelas', 'jurnal.nama_kelas = kelas.id_kelas')
            ->join('mapel', 'jurnal.mapel = mapel.id_mapel')
            ->where('jurnal.nama_kelas', $pilih_kelas)
            ->orderBy('jurnal.hari_tanggal', 'DESC')
            ->orderBy('jurnal.jam_ke', 'ASC')
            ->findAll();
---
SELECT `jurnal`.*, `kelas`.`nama_kelas`, `mapel`.`nama_mapel`
FROM `jurnal`
JOIN `kelas` ON `jurnal`.`nama_kelas` = `kelas`.`id_kelas`
JOIN `mapel` ON `jurnal`.`mapel` = `mapel`.`id_mapel`
WHERE `jurnal`.`nama_kelas` IS NULL
ORDER BY `jurnal`.`hari_tanggal` DESC, `jurnal`.`jam_ke` ASC

    public function getCetakJurnalGuru($pilih_pengguna, $pilih_bulan, $pilih_tahun)
    {
        return $this->select('jurnal.hari_tanggal, jurnal.jam_ke, kelas.nama_kelas,
                          COUNT(CASE WHEN daftar_hadir.keterangan = "Hadir" THEN 1 END) AS jumlah_hadir,
                          COUNT(CASE WHEN daftar_hadir.keterangan = "Sakit" THEN 1 END) AS jumlah_sakit,
                          COUNT(CASE WHEN daftar_hadir.keterangan = "Ijin" THEN 1 END) AS jumlah_ijin,
                          COUNT(CASE WHEN daftar_hadir.keterangan = "Alpa" THEN 1 END) AS jumlah_alpa,
                          GROUP_CONCAT(siswa.nama_siswa SEPARATOR ", ") AS nama_siswa_absen,
                          jurnal.uraian_materi, jurnal.keterangan, jurnal.media_pembelajaran')
            ->join('kelas', 'jurnal.nama_kelas = kelas.id_kelas')
            ->join('daftar_hadir', 'jurnal.nama_kelas = daftar_hadir.nama_kelas AND jurnal.hari_tanggal = daftar_hadir.hari_tanggal', 'left')
            ->join('siswa', 'daftar_hadir.nama_siswa = siswa.id_siswa', 'left')
            ->where('jurnal.nama_lengkap', $pilih_pengguna)
            ->where('MONTH(jurnal.hari_tanggal)', $pilih_bulan)
            ->where('YEAR(jurnal.hari_tanggal)', $pilih_tahun)
            ->groupBy('jurnal.hari_tanggal, jurnal.jam_ke')
            ->orderBy('jurnal.hari_tanggal', 'DESC')
            ->orderBy('jurnal.jam_ke', 'ASC')
            ->findAll();
---
SELECT `jurnal`.`hari_tanggal`, `jurnal`.`jam_ke`, `kelas`.`nama_kelas`, COUNT(CASE WHEN daftar_hadir.keterangan = "Hadir" THEN 1 END) AS jumlah_hadir, COUNT(CASE WHEN daftar_hadir.keterangan = "Sakit" THEN 1 END) AS jumlah_sakit, COUNT(CASE WHEN daftar_hadir.keterangan = "Ijin" THEN 1 END) AS jumlah_ijin, COUNT(CASE WHEN daftar_hadir.keterangan = "Alpa" THEN 1 END) AS jumlah_alpa, GROUP_CONCAT(siswa.nama_siswa SEPARATOR ", ") AS nama_siswa_absen, `jurnal`.`uraian_materi`, `jurnal`.`keterangan`, `jurnal`.`media_pembelajaran`
FROM `jurnal`
JOIN `kelas` ON `jurnal`.`nama_kelas` = `kelas`.`id_kelas`
LEFT JOIN `daftar_hadir` ON `jurnal`.`nama_kelas` = `daftar_hadir`.`nama_kelas` AND `jurnal`.`hari_tanggal` = `daftar_hadir`.`hari_tanggal`
LEFT JOIN `siswa` ON `daftar_hadir`.`nama_siswa` = `siswa`.`id_siswa`
WHERE `jurnal`.`nama_lengkap` IS NULL
AND MONTH(jurnal.hari_tanggal) IS NULL
AND YEAR(jurnal.hari_tanggal) IS NULL
GROUP BY `jurnal`.`hari_tanggal`, `jurnal`.`jam_ke`
ORDER BY `jurnal`.`hari_tanggal` DESC, `jurnal`.`jam_ke` ASC

    public function getCetakJurnalKelas($pilih_kelas, $pilih_bulan, $pilih_tahun)
    {
        return $this->select('jurnal.*, kelas.nama_kelas, mapel.nama_mapel,
                          COUNT(CASE WHEN daftar_hadir.keterangan = "Hadir" THEN 1 END) AS jumlah_hadir,
                          COUNT(CASE WHEN daftar_hadir.keterangan = "Sakit" THEN 1 END) AS jumlah_sakit,
                          COUNT(CASE WHEN daftar_hadir.keterangan = "Ijin" THEN 1 END) AS jumlah_ijin,
                          COUNT(CASE WHEN daftar_hadir.keterangan = "Alpa" THEN 1 END) AS jumlah_alpa,
                          GROUP_CONCAT(siswa.nama_siswa SEPARATOR ", ") AS nama_siswa_absen,
                          pengguna.nama_lengkap')
            ->join('pengguna', 'jurnal.nama_lengkap = pengguna.id_pengguna')
            ->join('mapel', 'jurnal.mapel = mapel.id_mapel')
            ->join('kelas', 'jurnal.nama_kelas = kelas.id_kelas')
            ->join('daftar_hadir', 'jurnal.nama_kelas = daftar_hadir.nama_kelas AND jurnal.hari_tanggal = daftar_hadir.hari_tanggal', 'left')
            ->join('siswa', 'daftar_hadir.nama_siswa = siswa.id_siswa', 'left')
            ->where('jurnal.nama_kelas', $pilih_kelas)
            ->where('MONTH(jurnal.hari_tanggal)', $pilih_bulan)
            ->where('YEAR(jurnal.hari_tanggal)', $pilih_tahun)
            ->groupBy('jurnal.hari_tanggal, jurnal.jam_ke')
            ->orderBy('jurnal.hari_tanggal', 'DESC')
            ->orderBy('jurnal.jam_ke', 'ASC')
            ->findAll();
---
SELECT `jurnal`.*, `kelas`.`nama_kelas`, `mapel`.`nama_mapel`, COUNT(CASE WHEN daftar_hadir.keterangan = "Hadir" THEN 1 END) AS jumlah_hadir, COUNT(CASE WHEN daftar_hadir.keterangan = "Sakit" THEN 1 END) AS jumlah_sakit, COUNT(CASE WHEN daftar_hadir.keterangan = "Ijin" THEN 1 END) AS jumlah_ijin, COUNT(CASE WHEN daftar_hadir.keterangan = "Alpa" THEN 1 END) AS jumlah_alpa, GROUP_CONCAT(siswa.nama_siswa SEPARATOR ", ") AS nama_siswa_absen, `pengguna`.`nama_lengkap`
FROM `jurnal`
JOIN `pengguna` ON `jurnal`.`nama_lengkap` = `pengguna`.`id_pengguna`
JOIN `mapel` ON `jurnal`.`mapel` = `mapel`.`id_mapel`
JOIN `kelas` ON `jurnal`.`nama_kelas` = `kelas`.`id_kelas`
LEFT JOIN `daftar_hadir` ON `jurnal`.`nama_kelas` = `daftar_hadir`.`nama_kelas` AND `jurnal`.`hari_tanggal` = `daftar_hadir`.`hari_tanggal`
LEFT JOIN `siswa` ON `daftar_hadir`.`nama_siswa` = `siswa`.`id_siswa`
WHERE `jurnal`.`nama_kelas` IS NULL
AND MONTH(jurnal.hari_tanggal) IS NULL
AND YEAR(jurnal.hari_tanggal) IS NULL
GROUP BY `jurnal`.`hari_tanggal`, `jurnal`.`jam_ke`
ORDER BY `jurnal`.`hari_tanggal` DESC, `jurnal`.`jam_ke` ASC