app/Models/JurnalKelas.php

SELECT `jurnal_kelas`.*, `kelas`.`nama_kelas`, `mapel`.`nama_mapel`
FROM `jurnal_kelas`
JOIN `kelas` ON `jurnal_kelas`.`nama_kelas` = `kelas`.`id_kelas`
JOIN `mapel` ON `jurnal_kelas`.`mapel` = `mapel`.`id_mapel`
WHERE `jurnal_kelas`.`nama_kelas` = '64'
ORDER BY `jurnal_kelas`.`hari_tanggal` DESC, `jurnal_kelas`.`jam_ke` ASC
---
    public function getJurnalJoinKelasMapel($pilih_kelas)
    {
        return $this->select('jurnal_kelas.* , kelas.nama_kelas, mapel.nama_mapel')
            ->join('kelas', 'jurnal_kelas.nama_kelas = kelas.id_kelas')
            ->join('mapel', 'jurnal_kelas.mapel = mapel.id_mapel')
            ->where('jurnal_kelas.nama_kelas', $pilih_kelas)
            ->orderBy('jurnal_kelas.hari_tanggal', 'DESC')
            ->orderBy('jurnal_kelas.jam_ke', 'ASC')
            ->findAll();

SELECT `jurnal_kelas`.*, `kelas`.`nama_kelas`, `mapel`.`nama_mapel`, COUNT(CASE WHEN daftar_hadir.keterangan = "Hadir" THEN 1 END) AS jumlah_hadir, COUNT(CASE WHEN daftar_hadir.keterangan = "Ijin" THEN 1 END) AS jumlah_ijin, COUNT(CASE WHEN daftar_hadir.keterangan = "Alpa" THEN 1 END) AS jumlah_alpa, GROUP_CONCAT(siswa.nama_siswa SEPARATOR ", ") AS nama_siswa_absen, `pengguna`.`nama_lengkap`
FROM `jurnal_kelas`
JOIN `pengguna` ON `jurnal_kelas`.`nama_lengkap` = `pengguna`.`id_pengguna`
JOIN `mapel` ON `jurnal_kelas`.`mapel` = `mapel`.`id_mapel`
JOIN `kelas` ON `jurnal_kelas`.`nama_kelas` = `kelas`.`id_kelas`
LEFT JOIN `daftar_hadir` ON `jurnal_kelas`.`nama_kelas` = `daftar_hadir`.`nama_kelas` AND `jurnal_kelas`.`hari_tanggal` = `daftar_hadir`.`hari_tanggal`
LEFT JOIN `siswa` ON `daftar_hadir`.`nama_siswa` = `siswa`.`id_siswa`
WHERE `jurnal_kelas`.`nama_kelas` IS NULL
AND MONTH(jurnal_kelas.hari_tanggal) IS NULL
AND YEAR(jurnal_kelas.hari_tanggal) IS NULL
GROUP BY `jurnal_kelas`.`hari_tanggal`, `jurnal_kelas`.`jam_ke`
ORDER BY `jurnal_kelas`.`hari_tanggal` DESC, `jurnal_kelas`.`jam_ke` ASC
---
    public function getCetakJurnalKelas($pilih_kelas, $pilih_bulan, $pilih_tahun)
    {
        return $this->select('jurnal_kelas.*, kelas.nama_kelas, mapel.nama_mapel,
                          COUNT(CASE WHEN daftar_hadir.keterangan = "Hadir" THEN 1 END) AS jumlah_hadir,
                          COUNT(CASE WHEN daftar_hadir.keterangan = "Ijin" THEN 1 END) AS jumlah_ijin,
                          COUNT(CASE WHEN daftar_hadir.keterangan = "Alpa" THEN 1 END) AS jumlah_alpa,
                          GROUP_CONCAT(siswa.nama_siswa SEPARATOR ", ") AS nama_siswa_absen,
                          pengguna.nama_lengkap')
            ->join('pengguna', 'jurnal_kelas.nama_lengkap = pengguna.id_pengguna')
            ->join('mapel', 'jurnal_kelas.mapel = mapel.id_mapel')
            ->join('kelas', 'jurnal_kelas.nama_kelas = kelas.id_kelas')
            ->join('daftar_hadir', 'jurnal_kelas.nama_kelas = daftar_hadir.nama_kelas AND jurnal_kelas.hari_tanggal = daftar_hadir.hari_tanggal', 'left')
            ->join('siswa', 'daftar_hadir.nama_siswa = siswa.id_siswa', 'left')
            ->where('jurnal_kelas.nama_kelas', $pilih_kelas)
            ->where('MONTH(jurnal_kelas.hari_tanggal)', $pilih_bulan)
            ->where('YEAR(jurnal_kelas.hari_tanggal)', $pilih_tahun)
            ->groupBy('jurnal_kelas.hari_tanggal, jurnal_kelas.jam_ke')
            ->orderBy('jurnal_kelas.hari_tanggal', 'DESC')
            ->orderBy('jurnal_kelas.jam_ke', 'ASC')
            ->findAll();