app/Models/Kelas.php

SELECT `nama_kelas`
FROM `kelas`
WHERE `id_kelas` IS NULL
---
    public function getNamaKelas($pilih_kelas)
    {
        return $this->select('nama_kelas')
        ->where('id_kelas', $pilih_kelas)
        ->findAll();

SELECT `kelas`.*, `pengguna`.`nama_lengkap`
FROM `kelas`
JOIN `pengguna` ON `kelas`.`wali_kelas` = `pengguna`.`id_pengguna`
---
    public function kelasJoinPengguna()
    {
        return $this->select('kelas.*, pengguna.nama_lengkap')
        ->join('pengguna', 'kelas.wali_kelas = pengguna.id_pengguna')
        ->findAll();

SELECT `kelas`.*
FROM `kelas`
JOIN `pengguna` ON `pengguna`.`id_pengguna` = `kelas`.`wali_kelas`
WHERE `pengguna`.`nama_lengkap` = 'Salsabila Asofa'
---
    public function getKelasByWaliKelas($nama_lengkap)
    {
        return $this->select('kelas.*')
        ->join('pengguna', 'pengguna.id_pengguna = kelas.wali_kelas')
        ->where('pengguna.nama_lengkap', $nama_lengkap)
        ->findAll();