app/Models/Pembelajaran.php

    public function pembelajaranJoinKelas($nama_lengkap)
    {
        return $this->select('pembelajaran.*, pengguna.nama_lengkap, kelas.nama_kelas , kelas.id_kelas, mapel.nama_mapel')
        ->join('pengguna', 'pengguna.id_pengguna = pembelajaran.pengguna')
        ->join('kelas', 'kelas.id_kelas = pembelajaran.kelas')
        ->join('mapel', 'mapel.id_mapel = pembelajaran.mapel')
        ->where('pengguna.nama_lengkap', $nama_lengkap)
        ->orderBy('kelas.nama_kelas', 'ASC')
        ->findAll();
---
SELECT `pembelajaran`.*, `pengguna`.`nama_lengkap`, `kelas`.`nama_kelas`, `kelas`.`id_kelas`, `mapel`.`nama_mapel`
FROM `pembelajaran`
JOIN `pengguna` ON `pengguna`.`id_pengguna` = `pembelajaran`.`pengguna`
JOIN `kelas` ON `kelas`.`id_kelas` = `pembelajaran`.`kelas`
JOIN `mapel` ON `mapel`.`id_mapel` = `pembelajaran`.`mapel`
WHERE `pengguna`.`nama_lengkap` = 'Salsabila Asofa'
ORDER BY `kelas`.`nama_kelas` ASC