app/Models/Pengguna.php

SELECT `pengguna`.`nama_lengkap`, `pengguna`.`id_pengguna`
FROM `pengguna`
WHERE `pengguna`.`nama_lengkap` = 'Salsabila Asofa'
---
    public function getPengguna($nama_lengkap)
    {
        return $this->select('pengguna.nama_lengkap, pengguna.id_pengguna')
        ->where('pengguna.nama_lengkap', $nama_lengkap)
        ->findAll();

SELECT `pengguna`.*
FROM `pengguna`
WHERE `pengguna`.`jabatan` = 'Guru'
ORDER BY `nama_lengkap` ASC
---
    public function penggunaAdminGuru()
    {
        return $this->select('pengguna.*')
        ->where('pengguna.jabatan', 'Guru')
        ->orderBy('nama_lengkap', 'ASC')
        ->findAll();

SELECT `pengguna`.*
FROM `pengguna`
WHERE `pengguna`.`jabatan` = 'Kepala Sekolah'
---
    public function getKepalaSekolah()
    {
        return $this->select('pengguna.*')
        ->where('pengguna.jabatan', 'Kepala Sekolah')
        ->findAll();